#Модуль: Заказы (orders)

##Модели

- Costumer - Заказчик. Объекты которые хранят информацию о лице сделавшем заказ, могут быть связалы/не связаны с User
- Order - Заказ. Дата, Время, Статус, Стоимость, Ответственный менеджер и т.п.
- OrderProduct - Купленный продукт. Независящий от реальных продуктов и их параметров. Все связанные с ним данные хранятся в сериализованном виде, потому что заказ должен быть неизменным и доступным, даже после удаления/редактирования товара.
- OrderStatus - Статус заказа
- PaymentType - Способ оплаты

**Order**

- `public static function constructOrderFromCart()`
Возвращает объект Order, созданный из товаров находящихвся в корзине. Используется при оформлении заказа.

**OrderController**

- `public function actionIndex()`
Выводит и обрабатывает форму оформления заказа.
