<h4>Заметки</h4>

<p>
    <strong>Тег {{cut}} сокращает длинное содержание</strong> страниц при выводе страниц в списке.
    После тега {{cut}} помещается ссылка <<читать далее>>, при переходе по которой,
    уже отображается содержание страницы полностью
</p>

<p>
    <strong>Используйте картинку перед текстом.</strong>
    Код картинки: <br>
    <?= htmlspecialchars('<img src="путь до картинки" class="page-img" />'); ?>. <br>
    Не забывайте указывать у тега img атрибут class "page-img".
</p>



