#Совместная работа над проектом

Если над проектом трудится более одного человека, то использование следующих
инструментов может существенно увеличить скорость и простоту разработки.



**Порядок внесения изменений в БД**

- Все изменения в структуре БД делаются через [миграции](http://yiiframework.ru/doc/guide/ru/database.migration).
- Если миграция ушла в репозиторий и запускалась при этом нормально, исправлять её нельзя. Считайте, что вся команда её уже применила. Корректировки в этом случае делаются новой миграцией.
- Если миграция ушла в репозиторий и не запускалась при этом нормально, её необходимо поправить и как можно быстрее (именно ту миграцию, которая не применяется).
- Если используется `MySQL`, указывайте `engine` и `collation`. Умолчания не сервере могут отличаться.
- Ни в коем случае не стоит лезть в базу руками в обход миграций.
- Для удобного использования миграций существует `gii` компонент для их генерации. Использование его описано ниже.
- Для применения миграций используйте расширение `WebShell`. Использование его описано ниже.


**Gii Migrate Generator**

По адресу `/gii` можно найти генератор миграций - `Migrate Generator`.

Работает он следующим образом:

- Редактируете базу в любой программе для арботы с базами данных: (NaviCat, Workbanch)
- Вместо сохранения перейдите на вкладку SQL Preview
- Скопируйте оттуда код и вставьте в генератор миграций
- Нажмите предпросмотр, а затем генерацию миграции.

> **Внимание:** Для создания 2-х миграций подряд, вам придется перейти по ссылке `Migrate Generator` еще раз.


**WebShell**

По адресу `/webshell` можно найти специальную консоль.
В этой консоли доступны комманды консольногонго `Yii` приложения.

Например `yiic migrate up` - применит миграции

К сожалению через `WebShell` пока не доступен интерактивный режим.

Подробное руководство по консольным коммандам `Yii` вы можете найти [здесь](http://yiiframework.ru/doc/guide/ru/topics.console)


**Редактирование таблицы стилей**

- В ходе разработки Программист вправе дополнять таблицу CSS стилей.
- Все дополнения сохраняются отдельным файлом, с именем extra.css,
и по окончании разработки передаются верстальщику для анализа недоработок и ошибок.

