#Модуль: glossary (глоссарий)

Модуль аналогичен модулю новостей, однако для ориентирования по записям здесь используется
навигация ввиде алфавита и символа '#'(все записи)

При воходе в конкретную букву будут отображаться только записи заданный атрибут которых начинается
с этой буквы(обычно это title)


##Модель Glossary

- `public function onlyFirstChars($field)` - scope, после использования которого вернутся вместо
    обычных моделей, модель в поле `letter` которой будет назодиться первая буква заданного поля `$field`
- `public static function noEmptyChars($field)` - Возвращает массив букв для которых есть записи
- `public function getLastNoEmptyChar($field)` - Возвращает первую непустую букву

##Доступные компоненты

За основу альфа-навигации взят набор компонентов [alphapager](http://www.yiiframework.com/extension/alphapager/)

Однако этот набор компонентов может работать только с одним языком.
Для реализации мультиязычности был изменен компонент `ApPagination`.
В него были добавлены поля:
- `public static $alphabet` - набор алфавитов
- `public static $langs` - набор языков

А так же методы:
- `public static function getAllLetters($toDropDown = false)` - Возвращает массив из всех языков
- `public static function getWordIndex($word)` - Возвращает индекс буквы которой принадлежит это слово.
     Исправляет проблемы с мультибайтными кодировками
- `public static function getFirstLetter($word)` - Возвращает первую букву слова, с учетом мультибайтных кодировок

##Поддержка нескольких языков

Для поддержки мультиязычности созданы 2 компонента: **`MultilangApLinkPager`**, **`MultilangApListView`**
Их использование ничем не отличается от аналогичных `Yii` компонентов.

