#Модуль: main (главный системный модуль)

Этот модуль обеспечивает за поддержку:

- Мультиязычности
- Мета-теги
- Логирование

##Модели

- `Language` - Язык, соответственно есть возможность добавлять новые языки.
- `Log` - Логи
- `MetaTag` - Метатеги, эта модель может быть подключена к любой другой модели через `relation`.
- `Setting` - Глобальные настройки сайта (параметры подключения к серверу отправки почты и т.п.)

**Settings**

- `public static function getValue($code)` - Возвращает значение настроеки по ее коду.
- `public static function checkRequired($codes, $module_id = null)` - проверяет на наличие всех
    настроек для заданного модуля в БД. Это можно испольовать при написании компонентов, для того,
    что бы напомнить программисту, какие установки нужно добавить для корректной его работы.

**MetaTag**

Модель которую можно прикрпить к любой `AR` одели с помощью `relation`. Это достигается за счет того, что
для каждой записи в БД `MetaTag` хранит `model_id` - имя класса модели-владельца метатегов, `object_id` -
`id` класса модели-владельца метатегов. Типичный вид таблици БД для метатегов:

model_id   |   object_id    |  title
-----------|----------------|-------------------------
News       |    1           |  Первая новость
News       |    2           |  Вторая новость
Page       |    7           |  Страница учета
Page       |    5           |  Страница обратной связи


Для любого экземпляра модели `News` мы можем однозначно получить объект с метаданными, но обычно это не
требуется, т.к. нужные метаданные подставляются в `HTML` автоматически.


**Log**

Логирование происходит автоматически. :-)

